In [1]:
import os
import psycopg2
import pandas as pd
import numpy as np
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine
from flask import Flask, jsonify, render_template
from flask_sqlalchemy import SQLAlchemy
from sqlalchemy import inspect

In [2]:
url = '************'

In [3]:
engine= sqlalchemy.create_engine(url)

In [4]:
coal_consumption_df = pd.read_sql("SELECT * FROM coal_consumption", engine)

In [63]:
coal_2017 = coal_consumption_df[coal_consumption_df['Year']=='2017']

In [69]:
coal_2017.head()

,Year,Belgium,Czech Republic,France,Germany,Italy,Netherlands,Poland,Portugal,Romania,...,Australia,New Zealand,Algeria,Egypt,Nigeria,South Africa,Iran,Kuwait,Saudi Arabia,United Arab Emirates
27,2017,4,45,15,222,15,15,129,6,27,...,119,2,0,1,0,192,2,0,0,2

In [75]:
rank_df = coal_2017.set_index('Year')

In [76]:
rank_df = rank_df.transpose()
rank_df = rank_df.sort_values('2017',ascending=False)
rank_df = rank_df.reset_index()
rank_df.columns = ['Country', 'Amount']

In [77]:
rank_df.head()

                    Country  Amount
0                     China    3607
1                     India     953
2  United States of America     649
3        Russian Federation     232
4                   Germany     222

In [79]:
rank_df.Country.iloc[3]

'Russian Federation'